eisup_2019_docmng_integration/src/DataProcessors/абс_ПроверкаНеЗакрытыхЗадач/абс_ПроверкаНеЗакрытыхЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ПроверкаНеЗакрытыхЗадач</name>
  <tabularSections>
    <name>СписокЗадач</name>
    <attributes>
      <name>ЗадачаВТехподдержку</name>
      <type>
        <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>EnumRef.абс_СтатусыЗаявокВПоддержку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ОтложенныеЗадачиПоПроверкиЗаяков/абс_ОтложенныеЗадачиПоПроверкиЗаяков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ОтложенныеЗадачиПоПроверкиЗаяков</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОтложенноВСекундах</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/DataProcessors/абс_ПроверкаНеЗакрытыхЗадач/ObjectModule.bsl
Процедура ЗаписьВРегистр(ОтложитьНаВремя) Экспорт
	
	Если ЗначениеЗаполнено(ОтложитьНаВремя) Тогда
		
		ДатаКонтроля = ТекущаяДата();
		Пользователь = глЗначениеПеременной("глТекущийПользователь");
				
		Если ОтложитьНаВремя = "Один час" Тогда
			ОтложитьНаВремя = 3600;
		ИначеЕсли ОтложитьНаВремя = "Два часа" Тогда
			ОтложитьНаВремя = 7200;
		ИначеЕсли ОтложитьНаВремя = "30 мин." Тогда
			ОтложитьНаВремя = 1800;				 
		Иначе
			ОтложитьНаВремя = 0; 
		КонецЕсли;	  
				
		НаборЗаписей = РегистрыСведений.абс_ОтложенныеЗадачиПоПроверкиЗаяков.СоздатьНаборЗаписей();
			
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		НаборЗаписей.Отбор.Период.Установить(ДатаКонтроля);
			
		НовЗапись = НаборЗаписей.Добавить();

		НовЗапись.Пользователь = Пользователь;
		НовЗапись.Период       = ДатаКонтроля;
		НовЗапись.ОтложенноВСекундах = ТекущаяДата() + ОтложитьНаВремя;

		НаборЗаписей.Записать(Истина);
		
		
	КонецЕсли;
	
КонецПроцедуры
